Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeCannotPasteSubpicksInvalidTarget
Cannot paste points or lines. Select a slab and modify sub elements to paste points or lines.

Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeCannotPasteSubpicksInOtherDoc
Cannot paste points or lines into another project. Paste points or lines into the original project only.